const citys = [
  {
    city: '北京市',
    center: [39.92461, 116.396778],
  },
  {
    city: '深圳市',
    center: [22.542319, 114.059338],
  },
  {
    city: '广州市',
    center: [23.129228, 113.264428],
  },
  {
    city: '上海市',
    center: [31.2304, 121.405],
  },
  {
    city: '杭州市',
    center: [30.2739, 120.087],
  },
  {
    city: '武汉市',
    center: [30.593, 114.237],
  },
  {
    city: '天津市',
    center: [39.0853, 117.131],
  },
  {
    city: '沈阳市',
    center: [41.8164, 123.33],
  },
  {
    city: '郑州市',
    center: [34.7653, 113.591],
  },
  {
    city: '西安市',
    center: [34.3026, 108.861],
  },
  {
    city: '南京市',
    center: [32.0357, 118.728],
  },
  {
    city: '济南市',
    center: [36.652286, 117.120131],
  },
  {
    city: '青岛市',
    center: [36.2565, 120.122],
  },
  {
    city: '大连市',
    center: [38.9893, 121.567],
  },
  {
    city: '合肥市',
    center: [31.856, 117.233],
  },
  {
    city: '哈尔滨市',
    center: [45.7572, 126.6],
  },
  {
    city: '成都市',
    center: [30.6787, 104.012],
  },
  {
    city: '重庆市',
    center: [29.5609, 106.396],
  },
  {
    city: '昆明市',
    center: [25.0396, 102.64],
  },
  {
    city: '宁波市',
    center: [29.9002, 121.516],
  },
  {
    city: '东莞市',
    center: [23.02, 113.752],
  },
  {
    city: '石家庄市',
    center: [38.0428, 114.476],
  },
  {
    city: '苏州市',
    center: [31.3105, 120.543],
  },
  {
    city: '长沙市',
    center: [28.197, 112.923],
  },
  {
    city: '长春市',
    center: [43.8868, 125.287],
  },
  {
    city: '太原市',
    center: [37.874, 112.609],
  },
  {
    city: '西宁市',
    center: [36.656, 101.692],
  },
  {
    city: '烟台市',
    center: [37.5111, 121.259],
  },
  {
    city: '兰州市',
    center: [36.0842, 103.727],
  },
  {
    city: '厦门市',
    center: [24.5226, 118.073],
  },
  {
    city: '南宁市',
    center: [22.817, 108.347],
  },
  {
    city: '福州市',
    center: [26.0659, 119.295],
  },
  {
    city: '泉州市',
    center: [24.8807, 118.58],
  },
  {
    city: '佛山市',
    center: [23.0135, 113.068],
  },
  {
    city: '三亚市',
    center: [18.2799, 109.469],
  },
  {
    city: '南昌市',
    center: [28.7353, 115.867],
  },
  {
    city: '呼和浩特市',
    center: [40.8116, 111.648],
  },
  {
    city: '常州市',
    center: [31.7724, 119.913],
  },
  {
    city: '廊坊市',
    center: [39.5378, 116.684],
  },
  {
    city: '无锡市',
    center: [31.593, 120.295],
  },
  {
    city: '大庆市',
    center: [46.5876, 125.103],
  },
  {
    city: '银川市',
    center: [38.5002, 106.148],
  },
  {
    city: '乌鲁木齐市',
    center: [43.8641, 87.5308],
  },
  {
    city: '鞍山市',
    center: [41.1078, 122.995],
  },
  {
    city: '本溪市',
    center: [41.3151, 123.777],
  },
  {
    city: '张家口市',
    center: [40.8244, 114.888],
  },
  {
    city: '潍坊市',
    center: [36.7069, 119.162],
  },
  {
    city: '贵阳市',
    center: [26.6244, 106.628],
  },
  {
    city: '海口市',
    center: [19.9867, 110.224],
  },
  {
    city: '珠海市',
    center: [22.2582, 113.521],
  },
  {
    city: '温州市',
    center: [28.0149, 120.635],
  },
  {
    city: '金华市',
    center: [29.098, 119.595],
  },
  {
    city: '嘉兴市',
    center: [30.7579, 120.705],
  },
  {
    city: '绍兴市',
    center: [29.9974, 120.56],
  },
  {
    city: '湖州市',
    center: [30.8682, 120.062],
  },
  {
    city: '连云港市',
    center: [34.6586, 119.32],
  },
  {
    city: '大同市',
    center: [40.0764, 113.3],
  },
  {
    city: '中山市',
    center: [22.5406, 113.329],
  },
  {
    city: '惠州市',
    center: [23.0909, 114.393],
  },
  {
    city: '柳州市',
    center: [24.3254, 109.416],
  },
  {
    city: '桂林市',
    center: [25.2736, 110.29],
  },
  {
    city: '曲靖市',
    center: [25.49, 103.796],
  },
  {
    city: '舟山市',
    center: [29.9854, 122.208],
  },
  {
    city: '清远市',
    center: [23.682, 113.056],
  },
  {
    city: '玉林市',
    center: [22.6545, 110.181],
  },
  {
    city: '拉萨市',
    center: [29.6299, 91.0351],
  },
  {
    city: '上饶市',
    center: [28.4546, 117.944],
  },
  {
    city: '孝感市',
    center: [30.9547, 113.934],
  },
  {
    city: '黄冈市',
    center: [30.4535, 114.872],
  },
  {
    city: '益阳市',
    center: [28.5539, 112.355],
  },
  {
    city: '自贡市',
    center: [29.3392, 104.778],
  },
  {
    city: '内江市',
    center: [29.5801, 105.058],
  },
  {
    city: '阆中市',
    center: [31.5794177, 105.973195],
  },
]

export default citys
